{
  "companyName": "FedEx",
  "identifier": "fedex",
  "baseLocation": "Plano",
  "country": "Texas",
  "skills": [
    "Java",
    "SpringBoot",
    "SpringJdbc",
    "OracleDB",
    "JMS",
    "Jenkins",
    "WebClient"
  ],
  "why": "Explored Java Spring Boot in more detail, dived deep in task planning and execution",
  "duration": "2023 Summer",
  "companyLoved4Points": [
    "SDE intern at FedEx printAndGo product team, responsible for modernizing the legacy application",
    "Implemented newer functionality, while ensuring legacy systems work with it",
    "Explored at depth for the understanding of development best practices",
    "Focused on working and delivering as a team"
  ],
  "order": 2,
  "companyDetailPoints": [
    {
      "id": "rest_apis_work",
      "tags": ["rest", "printAndGo"],
      "description": "Developed REST apis for microservice based application, focusing on modularity. Part of the <strong>printAndGo</strong> product team(FedEx mobile printing solution). Responsible for modernisation, for making the service lighter, highly available, and reliable for the customers."
    },
    {
      "id": "archi",
      "tags": ["system", "extra"],
      "description": "Implemented workflows of new apis, while understanding the requirements, and ensured best possible <strong>performance</strong>. Deep dived into understanding performance bottlenecks by reading <strong>RFC standards</strong>(eg- multipart form data, UUID), going over pre-existing documentation, etc.; highlighted performance critical bottlenecks, and ideated on ways by which it can be improved."
    },
    {
      "id": "scale",
      "tags": ["scale"],
      "description": "Designed an algorithm to generate unique codes considering concurrency, and scalability of real world."
    },
    {
      "id": "service",
      "tags": ["handsOn", "devOps"],
      "description": "Hands on development on SpringBoot; data access with Spring JdbcTemplate, async Web Client(OAuth), Jenkins, and PCF(Cloud Foundry)."
    }
  ],
  "highlights": [
    {
      "type": "perf_monitoring",
      "name": "Application memory monitoring",
      "logo": "performance_monitoring.png",
      "stmt": [
        "Used <strong>jVisualVM</strong> for monitoring the application for memory footprint. Analyzed for biggest memory consuming methods.",
        "Analyzed the output and suggested ways in which memory consumption can be reduced."
      ]
    },
    {
      "type": "improvement",
      "name": "Ideating on possible improvements",
      "logo": "improvement_workflows.png",
      "stmt": [
        "Read <strong>RFC standards</strong> and java docs (eg - multipart file, UUID), for understanding/suggesting better workflows."
      ]
    }
  ],
  "logo": "fedex.png"
}
